gig_app_api/app/controllers/gigs_controller.rb

SELECT "gigs".* FROM "gigs"
---
  def index
    @gigs = Gig.all

INSERT INTO "gigs" ("title", "client", "client_contact", "location", "date", "price", "created_at", "updated_at", "user_id", "time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @gig = Gig.new(gig_params)
    @gig.user_id = params[:user_id]

    respond_to do |format|
      if @gig.save

UPDATE "gigs" SET "title" = $1, "price" = $2, "created_at" = $3, "updated_at" = $4 WHERE "gigs"."id" = $5  [["title", "Testing After passing data context"], ["price", 20], ["created_at", "2020-08-18 16:57:50.220000"], ["updated_at", "2020-08-18 16:57:50.220000"], ["id", 10]]
---
  def update
      if @gig.update(gig_params)

DELETE FROM "gigs" WHERE "gigs"."id" = $1  [["id", 8]]
---
  def destroy
    puts "deleting a route"
    @gig.destroy

SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_gig
      @gig = Gig.find(params[:id])