gig_app_api/app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        user = User.create!(
            email: params["user"]["email"],
            password: params["user"]["password"],
            password_confirmation: params["user"]["password_confirmation"]
        )